app/Http/Controllers/OrderSignatureController.php

select * from `terms_sittngs` limit 1
---
    public function show(Order $order)
    {
        if ($order->signature_path) {
            return view('signature.already', compact('order'));
        }
        return view('signature.signature', [
            'order' => $order,
            'terms' => TermsSittng::first()

update `orders` set `signature` = '2025-09-03 01:36:48', `signature_path` = 'signatures/14-f2H2Dhul.png', `orders`.`updated_at` = '2025-09-03 01:36:48' where `id` = 14
---
    public function store(Request $request, Order $order)
    {
        $request->validate([
            'signature' => ['required','string'],
        ]);

        $dataUrl = $request->input('signature');
        if (!preg_match('#^data:image/(png|jpe?g);base64,#i', $dataUrl)) {
            return back()->withErrors(['signature' => 'Invalid signature image.']);
        }

        $image = base64_decode(preg_replace('#^data:image/\w+;base64,#i', '', $dataUrl));
        $path  = 'signatures/'.$order->id.'-'.Str::random(8).'.png';

        Storage::disk('public')->put($path, $image);

        $order->update([
            'signature_path'      => $path,
            'signature' => now()
        ]);