app/Http/Controllers/Dashboard/BankAccountsController.php

select * from `transactions` where (`account_id` = 1 or `receiver_id` = 1 or `sender_account_id` = 1) and `verified` = 1 order by `created_at` desc
---
    public function show( $bankAccount)
    {
        $bank = BankAccount::findOrFail($bankAccount);
        $startDate = request('start_date');
        $endDate = request('end_date');

        $transactions = Transaction::where(function ($query) use ($bank) {
                $query->where('account_id', $bank->id)
                      ->orWhere('receiver_id', $bank->id)
                      ->orWhere('sender_account_id', $bank->id);
                    })
                    ->when($startDate && $endDate, function ($query) use ($startDate, $endDate) {
                        return $query->whereBetween('date', [$startDate, $endDate]);
                    })
                    ->where(function ($query) {
                        $query->where('verified', "1")
                              ->orWhere("source" , "add_payment")
                              ->orWhere("source" , "charge_account")
                              ->orWhere("source" , "general_expenses");
                    })
                    ->where("amount" , ">" , 0)
                    ->orderBy('created_at', 'desc')
                    ->get();