app/Http/Controllers/Dashboard/BankAccountsController.php

    public function index()
    {
        $banks = BankAccount::orderBy('created_at','desc')->get();
---
select * from `bank_accounts` order by `created_at` desc

    public function show( $bankAccount)
    {
        $bank = BankAccount::findOrFail($bankAccount);
---
select * from `bank_accounts` where `bank_accounts`.`id` = '1' limit 1