app/Http/Controllers/Dashboard/CampReportController.php

select * from `camp_reports` where `camp_reports`.`deleted_at` is null order by `created_at` desc
select * from `services` where `services`.`id` in (1)
---
    public function index()
    {
        $this->authorize('viewAny', CampReport::class);

        $reports = CampReport::with(['service', 'creator'])
            ->latest()
            ->get();