app/Http/Controllers/Dashboard/ExpensesController.php

    public function show($id)
    {
        $this->authorize('view', Expense::class);

        $expenses = Expense::where('order_id', $id)->orderBy('created_at', 'desc')->get();
        $order = Order::findOrFail($id);
        $bankAccounts = BankAccount::all();
---
select * from `expenses` where `order_id` = '14' order by `created_at` desc
select * from `orders` where `orders`.`id` = '14' limit 1
select * from `bank_accounts`

    public function store(Request $request)
    {
        $this->authorize('create', Expense::class);

        $validated = $request->validate([
            'expense_item_id' => 'nullable|exists:expense_items,id',
            'account_id' => 'required|exists:bank_accounts,id',
            'price' => 'required|numeric|min:0',
            'payment_method' => 'nullable|string',
            'image' => 'nullable|image',
            'date' => 'nullable|date',
            'order_id' => 'nullable|exists:orders,id',
            'notes' => 'nullable|string',
        ]);

        $date = $request->date ? $request->date : date('y-m-d');
        $bankAccount = BankAccount::findOrFail($request->account_id);
        $bankAccount->update([
            'balance' => $bankAccount->balance - $request->price
        ]);

        if ($request->hasFile('image')) {
            $path = $request->file('image')->store('expenses', 'public');
        }

        Expense::create([
            'expense_item_id' => $request->expense_item_id,
            'account_id' => $request->account_id,
            'price' => $request->price,
            'payment_method' => $request->payment_method,
            'date' => $date,
            'notes' => $request->notes,
            'image' => $path ?? null,
            'order_id' => $request->order_id,
        ]);
---
select * from `bank_accounts` where `bank_accounts`.`id` = '1' limit 1
update `bank_accounts` set `balance` = 44916, `bank_accounts`.`updated_at` = '2025-09-03 00:57:12' where `id` = 1
insert into `expenses` (`expense_item_id`, `account_id`, `price`, `payment_method`, `date`, `statement`, `notes`, `image`, `order_id`, `source`, `updated_at`, `created_at`) values ('', '1', '100', 'cash', '25-09-03', 'csdac', '', '', '14', 'reservation_expenses', '2025-09-03 00:57:12', '2025-09-03 00:57:12')