app/Http/Controllers/Dashboard/ExpensesController.php

select * from `expenses` where `expenses`.`id` = '20' limit 1
---
    public function update(Request $request, $expense)
    {
        $expense = Expense::findOrFail($expense);