app/Http/Controllers/Dashboard/ExpenseItemsController.php

select * from `expense_items` order by `created_at` desc
---
    public function index()
    {
        $this->authorize('viewAny', ExpenseItem::class);

        $expenseItems = ExpenseItem::orderBy('created_at','desc')->get();

select * from `bank_accounts`
select * from `expense_items` order by `created_at` desc
---
    public function create()
    {
        $bankAccounts = BankAccount::all();
        $expenseItems = ExpenseItem::orderBy('created_at','desc')->get();