app/Http/Controllers/Dashboard/GeneralPaymentsController.php

    public function index(Request $request)
    {
        $query = Transaction::with([
                'order.customer',
                'order.expenses' => fn ($q) => $q->where('verified' , true),
                'order.addons'  => fn ($q) => $q->where('verified', true),
                'order.items'  => fn ($q) => $q->where('verified', true)
            ])
            ->where(fn ($q) =>
                $q->where('source', "insurances")
                ->whereHas("payment", fn ($q) => $q->whereNot('insurance_status', 'returned'))
                ->whereHas("order", fn ($q) => $q->where('insurance_status', "1"))
                ->orWhere('source', 'reservation_addon')
                ->orWhere('source', 'warehouse_sale')
            );

        if ($request->customer_id) {
            $query->whereHas('order.customer', function($q) use ($request) {
                $q->where('id', $request->customer_id);
            });
        }

        if ($request->order_id) {
            $query->where('order_id', $request->order_id);
---
select * from `expenses` where `expenses`.`order_id` in (14) and `verified` = 1
select * from `transactions` where (`source` = 'insurances' or `source` = 'reservation_addon' or `source` = 'warehouse_sale') and `verified` = '1'
select `addons`.*, `order_addon`.`order_id` as `pivot_order_id`, `order_addon`.`addon_id` as `pivot_addon_id`, `order_addon`.`verified` as `pivot_verified`, `order_addon`.`count` as `pivot_count`, `order_addon`.`price` as `pivot_price`, `order_addon`.`description` as `pivot_description`, `order_addon`.`id` as `pivot_id`, `order_addon`.`account_id` as `pivot_account_id`, `order_addon`.`payment_method` as `pivot_payment_method`, `order_addon`.`created_at` as `pivot_created_at`, `order_addon`.`updated_at` as `pivot_updated_at` from `addons` inner join `order_addon` on `addons`.`id` = `order_addon`.`addon_id` where `order_addon`.`order_id` in (14) and `verified` = 1
select * from `orders` where 0 = 1
select * from `customers` where `customers`.`id` in (20)
select * from `orders` where `orders`.`id` in (14)

        // Process order payment summaries (iterate by orders instead of customers)
        $orderSummaries = collect();
        foreach ($paymentsByOrder as $orderId => $orderTransactions) {
            $order = $orderTransactions->first()?->order;
---
select * from `orders` where `orders`.`id` in (16)

            ]);
        }

        $orders = Order::whereNot('insurance_status' , 'returned')->get();
        // Show all customers in filter, not only those with payments
        $customers = Customer::orderBy('name')->get(['id','name']);
---
select * from `orders` where not `insurance_status` = 'returned'
select `id`, `name` from `customers` order by `name` asc