app/Http/Controllers/Dashboard/GeneralPaymentsController.php

    public function index(Request $request)
    {
        // Use the service to get payment summaries and related data
        $data = $this->generalPaymentSummaryService->getPaymentSummariesWithStats($request);

        // Get the original transactions for the view (if needed)
        $query = Transaction::with([
                'order.customer',
                'order.expenses' => fn ($q) => $q->where('verified' , true),
                'order.addons'  => fn ($q) => $q->where('verified', true),
                'order.items'  => fn ($q) => $q->where('verified', true)
            ])
            ->where(fn ($q) =>
                $q->where('source', "insurances")
                ->whereHas("payment", fn ($q) => $q->whereNot('insurance_status', 'returned'))
                ->whereHas("order", fn ($q) => $q->where('insurance_status', "1"))
                ->orWhere('source', 'reservation_addon')
                ->orWhere('source', 'warehouse_sale')
            );

        if ($request->customer_id) {
            $query->whereHas('order.customer', function($q) use ($request) {
                $q->where('id', $request->customer_id);
            });
---
select * from `customers`

    public function create ()
    {
        $orders = Order::all();
        $bankAccounts = BankAccount::all();
        $recentGeneralPayments = GeneralPayment::with('account', 'order.customer')
            ->whereHas('transaction' , fn($q) => $q->where('source' , 'general_revenue_deposit'))
            ->latest()
            ->take(10)
            ->get();
---
select * from `payments` where `payments`.`order_id` = 16 and `payments`.`order_id` is not null