app/Http/Controllers/Dashboard/HomeController.php

select count(*) as aggregate from `customers`
select count(*) as aggregate from `orders`
select status, COUNT(*) as count from `orders` group by `status`
select * from `orders` order by `created_at` desc limit 20
select * from `orders` where `orders`.`id` in (3, 5, 6, 8, 9, 10, 11, 14)
select * from `payments` order by `created_at` desc limit 15
---
    public function index()
    {
        $totalCustomersCount = Customer::count();
        $totalOrdersCount = Order::count();
        $ordersCountByStatus = Order::selectRaw('status, COUNT(*) as count')
            ->groupBy('status')
            ->get()
            ->pluck('count', 'status');

        $latestOrders = Order::latest()->take(20)->get(); // Fetch latest 15 orders
        $latestPayments = Payment::with('order')->latest()->take(15)->get(); // Fetch latest 15 payments