app/Http/Controllers/Dashboard/OrderController.php

select `addons`.*, `order_addon`.`order_id` as `pivot_order_id`, `order_addon`.`addon_id` as `pivot_addon_id`, `order_addon`.`verified` as `pivot_verified`, `order_addon`.`count` as `pivot_count`, `order_addon`.`price` as `pivot_price`, `order_addon`.`description` as `pivot_description`, `order_addon`.`id` as `pivot_id`, `order_addon`.`account_id` as `pivot_account_id`, `order_addon`.`payment_method` as `pivot_payment_method`, `order_addon`.`created_at` as `pivot_created_at`, `order_addon`.`updated_at` as `pivot_updated_at` from `addons` inner join `order_addon` on `addons`.`id` = `order_addon`.`addon_id` where `order_addon`.`order_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14)
select `orders`.*, (select sum(`payments`.`price`) from `payments` where `orders`.`id` = `payments`.`order_id`) as `verified_payments_sum` from `orders` order by `created_at` desc limit 100 offset 0
select count(*) as aggregate from `orders`
---
    public function index()
    {
        $this->authorize('viewAny', Order::class);

        $validStatuses = ['completed', 'rejected', 'canceled', 'delayed'];
        $status = request()->query('status');
        $customerId = request()->query('customer_id');

        // price filters
        $filters = [
            'price_min' => request()->query('price_min'),
            'price_max' => request()->query('price_max'),
            'price' => request()->query('price'),
        ];

        $query = Order::query();

        if (in_array($status, $validStatuses)) {
            $query->where('status', $status);
        } elseif ($status == 'pending') {
            $query->where(fn($q) => $q->whereIn('status', ['pending_and_show_price', 'pending_and_Initial_reservation']));
        } else if ($status == 'approved') {
            $query->where(fn($q) => $q->whereIn('status', ['approved', 'delayed']));
        }

        if (!empty($customerId)) {
            $query->where('customer_id', $customerId);
        }

        $orders = $query->filter($filters)
            ->orderBy('created_at', 'desc')
            ->with(['payments', 'addons'])
            ->withSum(['payments as verified_payments_sum' => function ($q) {
                $q->verified();
            }], 'price')
            ->paginate(100);

select `id`, `name` from `customers`
select `id`, `name`, `price` from `services`
---
    public function create()
    {
        $this->authorize('create', Order::class);

        $customers = Customer::select('id', 'name')->get();
        $services = Service::select('id', 'name', 'price')->get();

select `id`, `name` from `customers`
select `id`, `name`, `price` from `services`
select sum(`price`) as aggregate from `order_addon` where `order_id` = 14
---
    public function edit($id)
    {
        $this->authorize('update', Order::class);
        $order = $this->orderRepository->findOne($id);
        $customers = Customer::select('id', 'name')->get();
        $services = Service::select('id', 'name', 'price')->get();
        $addonsPrice = OrderAddon::where('order_id', $order->id)->sum('price');

select * from `orders` where `orders`.`id` = '14' limit 1
insert into `order_addon` (`addon_id`, `order_id`, `created_at`, `updated_at`, `count`, `price`, `payment_method`, `account_id`, `description`) values ('4', 14, '2025-09-03 00:43:29', '2025-09-03 00:43:29', '1', '100.00', 'cash', '1', '')
---
    public function storeAddons(Request $request, $orderId)
    {
        $validatedData = $request->validate([
            'addon_id' => 'required|exists:addons,id',
            'count' => 'nullable|integer|min:1',
            'account_id' => 'nullable|exists:bank_accounts,id',
            'price' => 'required|numeric',
            'payment_method' => 'nullable|string',
            'description' => 'nullable|string',
        ]);
        $order = Order::findOrFail($orderId);
        $order->addons()->attach($validatedData['addon_id'], [
            'count' => $validatedData['count'],
            'price' => $validatedData['price'],
            'payment_method' => $validatedData['payment_method'] ?? null,
            'account_id' => $validatedData['account_id'] ?? null,
            'description' => $validatedData['description'] ?? '',
        ]);

select * from `orders` where `orders`.`id` = 14 limit 1
---
    public function addons($id)
    {
        $order = Order::with('addons')->findOrFail($id);

select * from `orders` where `orders`.`id` = '16' limit 1
---
    public function updateReports(Request $request, $id)
    {
        $this->updateStock($request->all());
        $data = $request->validate([
            'ordered_count.*' => 'nullable|numeric|min:1',
            'ordered_price.*' => 'nullable|numeric|min:1',
            'set_qty'   => 'required|array',
            'set_qty.*' => 'nullable|integer|min:0|max:100',
            'not_completed_reason' => 'nullable|array',
            'reports' => 'nullable|array',
            'report_text' => 'nullable|string'
        ]);
        FacadesDB::transaction(function () use ($data) {
            foreach ($data['reports'] as $id => $status) {
                $report = ServiceReport::firstOrNew(['id' => $id]);
                if ($report) {
                    $report->update([
                        'is_completed' => ($status === 'completed') ? true : false,
                        'not_completed_reason' => $data['not_completed_reason'][$id] ?? null,
                        'set_qty' => $data['set_qty'][$id] ?? 0,
                    ]);
                }
            }
        });
        $order = Order::with('reports')->findOrFail($id);

select * from `orders` where `orders`.`id` = '14' limit 1
select * from `terms_sittngs` limit 1
---
    public function quote($order)
    {
        $order = Order::with(['payments', 'addons', 'services', 'customer'])->findOrFail($order);
        $termsSittng = TermsSittng::firstOrFail();