app/Http/Controllers/Dashboard/OrderController.php

select * from `payments` where `payments`.`id` = 54 limit 1
---
    public function getInvoiceByLink($link)
    {
        $invoiceLink = InvoiceLink::where('link', $link)->firstOrFail();
        $order = Order::with('payments', 'services')->findOrFail($invoiceLink->order_id);