app/Http/Controllers/Dashboard/PaymentsController.php

select * from `transactions` where `verified` = 1 and `verified` = '1' order by `created_at` desc
---
    public function transactions()
    {

        $startDate = request('start_date');
        $endDate = request('end_date');

        $transactions = Transaction::when($startDate && $endDate, function ($query) use ($startDate, $endDate) {
                return $query->whereBetween('date', [$startDate, $endDate]);
            })
            ->orderBy('created_at', 'desc')
            ->where(function ($query) {
                $query->where('verified', "1");
                    //   ->whereHas('payment', fn($q) => $q->whereNot('insurance_status', 'returned'))
                    //   ->orWhere("source", "charge_account")//they will have verificaion button
                    //   ->orWhere("source", "general_payments_deposit");//they will have verificaion button
            }) // this is the transaction source for the page which have not approved button
            ->where("amount", ">", 0)
            ->get();

select * from `customers`
select * from `customers` where `customers`.`id` in (1, 2, 17, 18, 20)
select * from `expenses` where `expenses`.`order_id` in (3, 5, 6, 8, 10, 11, 14)
select * from `orders` where `orders`.`id` in (3, 5, 6, 8, 10, 11, 14)
select `addons`.*, `order_addon`.`order_id` as `pivot_order_id`, `order_addon`.`addon_id` as `pivot_addon_id`, `order_addon`.`verified` as `pivot_verified`, `order_addon`.`count` as `pivot_count`, `order_addon`.`price` as `pivot_price`, `order_addon`.`description` as `pivot_description`, `order_addon`.`id` as `pivot_id`, `order_addon`.`account_id` as `pivot_account_id`, `order_addon`.`payment_method` as `pivot_payment_method`, `order_addon`.`created_at` as `pivot_created_at`, `order_addon`.`updated_at` as `pivot_updated_at` from `addons` inner join `order_addon` on `addons`.`id` = `order_addon`.`addon_id` where `order_addon`.`order_id` in (3, 5, 6, 8, 10, 11, 14)
select * from `orders` where not `insurance_status` = 'returned'
---
    public function index(Request $request)
    {
        $this->authorize('viewAny', Payment::class);

        $query = Payment::with(['order.customer', 'order.addons', 'order.items', 'order.expenses'])->where(
            fn($q) =>
            $q->whereNot('statement', 'the_insurance')
        );

        if ($request->customer_id) {
            $query->whereHas('order.customer', function ($q) use ($request) {
                $q->where('id', $request->customer_id);
            });
        }

        if ($request->order_id) {
            $query->where('order_id', $request->order_id);
        }

        if ($request->date_from && $request->date_to) {
            $dateFrom = Carbon::parse($request->date_from)->startOfDay();
            $dateTo = Carbon::parse($request->date_to)->endOfDay();
            $query->whereBetween('created_at', [$dateFrom, $dateTo]);
        }
        $payments = $query->where('verified', "1")->get();

        $orders = Order::whereNot('insurance_status', 'returned')->get();

select * from `bank_accounts` where `bank_accounts`.`id` = '4' limit 1
select * from `bank_accounts`
---
    public function create($bankAccount = null)
    {
        $this->authorize('create', Payment::class);
        $selectedBank = $bankAccount ? BankAccount::findOrFail($bankAccount) : null;
        $bankAccounts = BankAccount::all();

select * from `bank_accounts` where `bank_accounts`.`id` = '1' limit 1
---
    public function transfer($bankAccount = null)
    {
        $selectedBank = $bankAccount ? BankAccount::findOrFail($bankAccount) : null;

select * from `payments` where `payments`.`id` = '52' limit 1
---
    public function accountsUpdate(Request $request, $id)
    {
        $account_id = $payment->account_id;
        $receiver = $payment->receiver_id;
        $disccountFormAccount = $payment->amount;
        $amount = $request->amount;
        $paymentAmount = $payment->amount;

        $validatedData = $request->validate([
            'amount' => 'required|numeric|min:0',
            'receiver_id' => 'required|exists:bank_accounts,id',
            'account_id' => 'required|exists:bank_accounts,id',
            'date' => 'nullable|date',
            'description' => 'nullable|string',
            'payment_method' => 'nullable|string',
            'image' => 'nullable|image|mimes:jpeg,png,jpg,gif,svg',
        ]);

        DB::beginTransaction();

        try {
            // Handle optional replacement image
            if ($request->hasFile('image')) {
                $path = $request->file('image')->store('payments/images', 'public');
                $validatedData['image_path'] = $path;
            }

            $payment = GeneralPayment::findOrFail($id);

update `payments` set `verified` = '1', `payments`.`updated_at` = '2025-09-02 21:14:23' where `id` = 52
update `transactions` set `verified` = '0', `transactions`.`updated_at` = '2025-09-02 21:14:23' where `payment_id` = 52
---
                }
            }
            $validatedData['verified'] = 0;
            $payment->transaction()->update($validatedData);

select * from `bank_accounts` where `bank_accounts`.`id` = '1' limit 1
---

                // If receiver changed, remove money from old receiver
                if ($receiver && $receiver != $request->receiver_id) {
                    $oldReceiver = BankAccount::find($receiver);

select * from `orders` where `orders`.`id` = '14' limit 1
---
    public function print($payment)
    {
        $payment = Payment::with('order.customer')->findOrFail($payment);