app/Http/Controllers/Dashboard/PaymentsController.php

select * from `payments` where `payments`.`order_id` = 16 and `payments`.`order_id` is not null
---
    public function store(Request $request)
    {
        $this->authorize('create', Payment::class);

        $validatedData = $request->validate([
            'order_id' => 'required|exists:orders,id',
            'account_id' => 'required|exists:bank_accounts,id',
            'price' => 'required|numeric',
            'source' => 'required|string',
            'payment_method' => 'required|string',
            'statement' => 'required',
            'notes' => 'nullable|string',
        ]);

        DB::beginTransaction();

        try {

            $payment = Payment::create($validatedData);

            if ($request->source) {
                if ($request->statement == 'deposit' || $request->statement == 'complete the amount') {
                    $source = 'reservation_payments';
                } else {
                    $source = 'insurances';
                }
            }

            Transaction::create([
                'account_id' => $request->account_id,
                'amount' => $request->price,
                'type' => 'deposit',
                'source'=> $source ? $source : $request->source,
                'date' => now(),
                'description' => 'Payment: ' . $request->statement,
                'payment_id' => $payment->id,
                'verified' => 0, // Changed from false to true so it appears in general payments
                'order_id' => $payment->order_id,
                'customer_id' => $payment->customer_id ?? null
            ]);