app/Http/Controllers/Dashboard/PaymentsController.php

update `bank_accounts` set `balance` = 686, `bank_accounts`.`updated_at` = '2025-09-03 00:39:38' where `id` = 1
---
    public function transactionsDestroy($id)
    {
        $payment = Transaction::findOrFail($id);
        $bankAccount = BankAccount::find($payment->account_id);
        $disccountFormAccount = $payment->amount;
        $amount = $payment->amount;

        $bankAccount->update([
            'balance' => $bankAccount->balance + $disccountFormAccount
        ]);

        if ($payment->receiver_id) {
            $transfareTo = BankAccount::find($payment->receiver_id);
            $transfareTo->update([
                'balance' => $transfareTo->balance - $amount
            ]);

update `bank_accounts` set `balance` = 1026, `bank_accounts`.`updated_at` = '2025-09-02 19:41:29' where `id` = 1
---
    public function store(Request $request)
    {
        $validatedData = $request->validate([
            'order_id' => 'required|exists:orders,id',
            'account_id' => 'required|exists:bank_accounts,id',
            'price' => 'required|numeric',
            'payment_method' => 'required|string',
            'statement' => 'required',
            'notes' => 'nullable|string',
        ]);

        $bankAccount = BankAccount::findOrFail($request->account_id);
        $payment = Payment::create($validatedData);

        $bankAccount->update([
            'balance' => $bankAccount->balance + $request->price
        ]);

select * from `orders` where `orders`.`id` = '16' limit 1
select * from `bank_accounts`
---
    public function show($order)
    {
        $order = Order::findOrFail($order);
        $bankAccounts = BankAccount::all();

update `bank_accounts` set `balance` = -500, `bank_accounts`.`updated_at` = '2025-09-02 22:49:01' where `id` = 6
---
    public function update(Request $request, $payment)
    {
        $payment = Payment::findOrFail($payment);
        $validatedData = $request->validate([
            'price' => 'required|numeric',
            'account_id' => 'required|exists:bank_accounts,id',
            'payment_method' => 'required|string',
            'statement' => 'required',
            'notes' => 'nullable|string',
        ]);

        $oldBankAccount = BankAccount::find($payment->account_id);
        //  return money back
        $oldBankAccount->update([
            'balance' => $oldBankAccount->balance - $payment->price
        ]);

        $payment->update($validatedData);


        $bankAccount = BankAccount::findOrFail($request->account_id);
        // take money form bank
        $bankAccount->update([
            'balance' => $bankAccount->balance + $request->price
        ]);

select * from `payments` where `payments`.`id` = '31' limit 1
select * from `bank_accounts` where `bank_accounts`.`id` = 6 limit 1
delete from `payments` where `id` = 31
---
    public function destroy($payment)
    {
        $payment = Payment::findOrFail($payment);

        $bankAccount = BankAccount::find($payment->account_id);
        $bankAccount->update([
            'balance' => $bankAccount->balance - $payment->price
        ]);

        $payment->delete();