app/Http/Controllers/Dashboard/StockController.php

select * from `stocks` order by `created_at` desc
---
    public function index()
    {
        $this->authorize('viewAny', Stock::class);

        // quantity fillter
        $filters = [
            'quantity_min' => request()->query('quantity_min'),
            'quantity_max' => request()->query('quantity_max'),
            'quantity' => request()->query('quantity'),
            'higher_selling' => request()->query('higher_selling'),
        ];
        $stocks = Stock::filter($filters)
            ->latest()
            ->get();