app/Http/Controllers/Dashboard/TermsSittngController.php

    public function index()
    {
         $this->authorize('viewAny', TermsSittng::class);

        $termsSittngs = TermsSittng::all();
---
select * from `terms_sittngs`

    public function create()
    {
         $this->authorize('create', TermsSittng::class);

        $termsSittng = TermsSittng::query()->first();
---
select * from `terms_sittngs` limit 1

    public function store(TermsSittngRequest $request)
    {
         $this->authorize('create', TermsSittng::class);


         $termsSittng = TermsSittng::updateOrCreate([
            "commercial_license_ar"=>$request->input('commercial_license_ar'),
            "commercial_license_en"=>$request->input('commercial_license_en')
         ]);
---
insert into `terms_sittngs` (`commercial_license_ar`, `commercial_license_en`, `updated_at`, `created_at`) values ('<ol><li style=\"direction: rtl; text-align: right;\">سيؤبسيش</li></ol>', '<ul><li><span style=\"font-size: 14px;\">sdafسيسي</span></li></ul>', '2025-09-03 01:22:47', '2025-09-03 01:22:47')
select * from `terms_sittngs` where (`commercial_license_ar` = '<ol><li style=\"direction: rtl; text-align: right;\">سيؤبسيش</li></ol>' and `commercial_license_en` = '<ul><li><span style=\"font-size: 14px;\">sdafسيسي</span></li></ul>') limit 1

    public function update(TermsSittngRequest $request)
    {
        $termsSittng = TermsSittng::first();
         $this->authorize('update', $termsSittng);

        $validatedData = $request->validated();
        $termsSittng->update($validatedData);

        return redirect()->route('terms_sittngs.create')
            ->with('success', 'تم تحديث الإعدادات بنجاح.');
---
select * from `terms_sittngs` limit 1
update `terms_sittngs` set `commercial_license_ar` = '<p style=\"direction: rtl; text-align: right;\">سيبشبسيش</p>', `terms_sittngs`.`updated_at` = '2025-09-03 01:39:53' where `id` = 5