app/Http/Controllers/Dashboard/WarehousesalesController.php

insert into `transactions` (`account_id`, `amount`, `description`, `order_id`, `type`, `source`, `stock_id`, `updated_at`, `created_at`) values ('1', '20.00', '', '14', 'deposit', 'warehouse_sale', '1', '2025-09-02 22:51:20', '2025-09-02 22:51:20')
---
    public function store(Request $request)
    {
        $data = $request->validate([
            'order_id' => 'required|exists:orders,id',
            'stock_id' => 'required|exists:stocks,id',
            'quantity' => 'required|numeric|min:0',
            'payment_method' => 'required|string',
            'account_id' => 'required|exists:bank_accounts,id',
            'total_price' => 'required|numeric|min:0',
            'notes' => 'nullable|string|max:255'
        ]);

        try {
            \DB::beginTransaction();
            Order::find($data['order_id'])->items()->create($data);
            $stock = Stock::findOrFail($data['stock_id']);
            if ($stock->quantity < $data['quantity'])
                throw new \Exception(__('dashboard.insufficient_stock'));
            $stock->decrement('quantity', $data['quantity']);
            Transaction::create([
                'account_id' => $data['account_id'],
                'amount' => $data['total_price'],
                'description' => $data['notes'],
                "type" =>"deposit",
                'source' => 'warehouse_sale',
                "stock_id" => $data['stock_id'],
            ]);

delete from `order_items` where `id` = 36
---
    public function destroy($id)
    {
        $item = OrderItem::findOrFail($id);
        $item->delete();