app/Http/Controllers/Dashboard/WarehousesalesController.php

select * from `orders` where `orders`.`id` = '16' limit 1
select `id`, `selling_price`, `name` from `stocks`
select * from `stocks` where `stocks`.`id` in (1)
select `name`, `id` from `bank_accounts`
---
    public function show($order)
    {
        $order = Order::findOrFail($order);

        return view('dashboard.warehouse_sales.show', [
            'order' => $order,
            'stocks' => Stock::select('id' , 'selling_price', 'name')->get(),
            'items' => $order->items()->with('stock')->get(),
            'bankAccounts' => \App\Models\BankAccount::pluck('name','id'),
        ]);

select * from `orders` where `orders`.`id` = '14' limit 1
select * from `stocks` where `stocks`.`id` = '1' limit 1
update `stocks` set `quantity` = `quantity` - 1, `stocks`.`updated_at` = '2025-09-02 22:51:20' where `id` = 1
insert into `order_items` (`order_id`, `stock_id`, `quantity`, `payment_method`, `account_id`, `total_price`, `notes`, `updated_at`, `created_at`) values (14, '1', '1', 'cash', '1', '20.00', '', '2025-09-02 23:49:12', '2025-09-02 23:49:12')
insert into `transactions` (`account_id`, `amount`, `description`, `order_id`, `type`, `source`, `stock_id`, `order_item_id`, `updated_at`, `created_at`) values ('1', '20.00', '', '14', 'deposit', 'warehouse_sale', '1', 45, '2025-09-03 00:06:42', '2025-09-03 00:06:42')
---
    public function store(Request $request)
    {
        $data = $request->validate([
            'order_id' => 'required|exists:orders,id',
            'stock_id' => 'required|exists:stocks,id',
            'quantity' => 'required|numeric|min:0',
            'payment_method' => 'required|string',
            'account_id' => 'required|exists:bank_accounts,id',
            'total_price' => 'required|numeric|min:0',
            'notes' => 'nullable|string|max:255'
        ]);

        DB::beginTransaction();

        try {
            // Create item via the order relation so order_id is set consistently
            $order = Order::findOrFail($data['order_id']);
            $stock = Stock::findOrFail($data['stock_id']);
            if ($stock->quantity < $data['quantity'])
                throw new \Exception(__('dashboard.insufficient_stock'));
            $stock->decrement('quantity', $data['quantity']);
            $orderItem = $order->items()->create($data);
            \App\Models\BankAccount::findOrFail($data['account_id'])->increment('balance', $data['total_price']);
            Transaction::create([
                'account_id' => $data['account_id'],
                'amount' => $data['total_price'],
                'description' => $data['notes'],
                'order_id' => $data['order_id'],
                "type" =>"deposit",
                'source' => 'warehouse_sale',
                "stock_id" => $data['stock_id'],
                'order_item_id' => $orderItem->id,
            ]);

select * from `order_items` where `order_items`.`id` = '36' limit 1
---
    public function update(Request $request, $id)
    {
        $data = $request->validate([
            'stock_id' => 'required|exists:stocks,id',
            'quantity' => 'required|numeric|min:0',
            'total_price' => 'required|numeric|min:0',
            'payment_method' => 'required|string',
            'account_id' => 'required|exists:bank_accounts,id',
            'notes' => 'nullable|string|max:255'
        ]);

        DB::beginTransaction();

        try {
            $item = OrderItem::findOrFail($id);